
## Terraform Plan

<details>
<summary>Click to expand</summary>

```
Acquiring state lock. This may take a few moments...
module.storage.data.azurerm_client_config.current: Reading...
module.rg.azurerm_resource_group.rg: Refreshing state... [id=/subscriptions/e4317e9d-1e23-409b-90dd-2ff05ac31fae/resourceGroups/cloudportfolio-prod-rg]
module.storage.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1lZGI2ZWE2NS02YWE1LTRmMGItOTA2Yi03NTRmY2Q3YzVjODM7b2JqZWN0SWQ9YTBiNmQ0MTgtODM0MS00NmEzLTliODEtOTI0MDEwNWU3OGNiO3N1YnNjcmlwdGlvbklkPWU0MzE3ZTlkLTFlMjMtNDA5Yi05MGRkLTJmZjA1YWMzMWZhZTt0ZW5hbnRJZD02YTNhOTIwOC1hODMzLTQ5NzctODc5ZC1kODAwZTAyOGM0ZWQ=]
module.identity.azurerm_user_assigned_identity.id: Refreshing state... [id=/subscriptions/e4317e9d-1e23-409b-90dd-2ff05ac31fae/resourceGroups/cloudportfolio-prod-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/cloudportfolio-prod-uaid]
module.functionapp.azurerm_application_insights.ai: Refreshing state... [id=/subscriptions/e4317e9d-1e23-409b-90dd-2ff05ac31fae/resourceGroups/cloudportfolio-prod-rg/providers/Microsoft.Insights/components/cloudportfolio-prod-ai]
module.functionapp.azurerm_service_plan.this: Refreshing state... [id=/subscriptions/e4317e9d-1e23-409b-90dd-2ff05ac31fae/resourceGroups/cloudportfolio-prod-rg/providers/Microsoft.Web/serverFarms/cloudportfolio-prod-fc-plan]
module.storage.azurerm_storage_account.sa: Refreshing state... [id=/subscriptions/e4317e9d-1e23-409b-90dd-2ff05ac31fae/resourceGroups/cloudportfolio-prod-rg/providers/Microsoft.Storage/storageAccounts/cloudportfolioprodsa]
module.storage.azurerm_role_assignment.github_blob: Refreshing state... [id=/subscriptions/e4317e9d-1e23-409b-90dd-2ff05ac31fae/resourceGroups/cloudportfolio-prod-rg/providers/Microsoft.Storage/storageAccounts/cloudportfolioprodsa/providers/Microsoft.Authorization/roleAssignments/4bce8760-862a-ebc7-cd72-081b17ec3e57]
module.storage.azurerm_storage_account_static_website.website: Refreshing state... [id=/subscriptions/e4317e9d-1e23-409b-90dd-2ff05ac31fae/resourceGroups/cloudportfolio-prod-rg/providers/Microsoft.Storage/storageAccounts/cloudportfolioprodsa]
module.storage.azurerm_storage_container.code: Refreshing state... [id=/subscriptions/e4317e9d-1e23-409b-90dd-2ff05ac31fae/resourceGroups/cloudportfolio-prod-rg/providers/Microsoft.Storage/storageAccounts/cloudportfolioprodsa/blobServices/default/containers/code]
module.storage.time_sleep.rbac_propagation: Refreshing state... [id=2025-12-14T14:35:32Z]
azurerm_role_assignment.identity_storage: Refreshing state... [id=/subscriptions/e4317e9d-1e23-409b-90dd-2ff05ac31fae/resourceGroups/cloudportfolio-prod-rg/providers/Microsoft.Storage/storageAccounts/cloudportfolioprodsa/providers/Microsoft.Authorization/roleAssignments/f60ef33f-c53d-797a-88c1-bdcbecf2582c]
module.functionapp.azurerm_function_app_flex_consumption.func: Refreshing state... [id=/subscriptions/e4317e9d-1e23-409b-90dd-2ff05ac31fae/resourceGroups/cloudportfolio-prod-rg/providers/Microsoft.Web/sites/cloudportfolio-prod-fn]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.cosmos.azurerm_cosmosdb_account.this will be created
  + resource "azurerm_cosmosdb_account" "this" {
      + access_key_metadata_writes_enabled           = true
      + analytical_storage_enabled                   = false
      + automatic_failover_enabled                   = false
      + burst_capacity_enabled                       = false
      + create_mode                                  = (known after apply)
      + default_identity_type                        = "FirstPartyIdentity"
      + endpoint                                     = (known after apply)
      + free_tier_enabled                            = false
      + id                                           = (known after apply)
      + is_virtual_network_filter_enabled            = false
      + kind                                         = "GlobalDocumentDB"
      + local_authentication_disabled                = false
      + location                                     = "eastus"
      + minimal_tls_version                          = "Tls12"
      + mongo_server_version                         = (known after apply)
      + multiple_write_locations_enabled             = false
      + name                                         = "cloudportfolio-prod-cosmos"
      + network_acl_bypass_for_azure_services        = false
      + offer_type                                   = "Standard"
      + partition_merge_enabled                      = false
      + primary_key                                  = (sensitive value)
      + primary_mongodb_connection_string            = (sensitive value)
      + primary_readonly_key                         = (sensitive value)
      + primary_readonly_mongodb_connection_string   = (sensitive value)
      + primary_readonly_sql_connection_string       = (sensitive value)
      + primary_sql_connection_string                = (sensitive value)
      + public_network_access_enabled                = true
      + read_endpoints                               = (known after apply)
      + resource_group_name                          = "cloudportfolio-prod-rg"
      + secondary_key                                = (sensitive value)
      + secondary_mongodb_connection_string          = (sensitive value)
      + secondary_readonly_key                       = (sensitive value)
      + secondary_readonly_mongodb_connection_string = (sensitive value)
      + secondary_readonly_sql_connection_string     = (sensitive value)
      + secondary_sql_connection_string              = (sensitive value)
      + write_endpoints                              = (known after apply)

      + analytical_storage (known after apply)

      + backup (known after apply)

      + capabilities {
          + name = "EnableServerless"
        }
      + capabilities {
          + name = "EnableTable"
        }

      + capacity (known after apply)

      + consistency_policy {
          + consistency_level = "Session"
        }

      + geo_location {
          + failover_priority = 0
          + id                = (known after apply)
          + location          = "eastus"
          + zone_redundant    = false
        }
    }

  # module.cosmos.azurerm_cosmosdb_table.visits will be created
  + resource "azurerm_cosmosdb_table" "visits" {
      + account_name        = "cloudportfolio-prod-cosmos"
      + id                  = (known after apply)
      + name                = "Visits"
      + resource_group_name = "cloudportfolio-prod-rg"
      + throughput          = (known after apply)
    }

  # module.cosmos.azurerm_role_assignment.func_cosmos will be created
  + resource "azurerm_role_assignment" "func_cosmos" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Cosmos DB Built-in Data Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.functionapp.azurerm_function_app_flex_consumption.func will be updated in-place
  ~ resource "azurerm_function_app_flex_consumption" "func" {
      ~ app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING" = (sensitive value)
          + "AzureWebJobsStorage"                   = (sensitive value)
          + "COSMOS_ACCOUNT_NAME"                   = "cloudportfolio-prod-cosmos"
          + "COSMOS_TABLE_NAME"                     = "Visits"
            # (1 unchanged element hidden)
        }
        id                                             = "/subscriptions/e4317e9d-1e23-409b-90dd-2ff05ac31fae/resourceGroups/cloudportfolio-prod-rg/providers/Microsoft.Web/sites/cloudportfolio-prod-fn"
        name                                           = "cloudportfolio-prod-fn"
        tags                                           = {}
        # (31 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string        = (sensitive value) -> null
            # (27 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

Plan: 3 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>
